{
  "backend/main.mo": "Main Motoko actor for the Ceiling Pro backend, managing bookings, service rates, time slot availability, image paths, and user profiles with role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report mapping two features (SiteHeader and SiteFooter restoration) to their relevant frontend page files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key behaviors of every component, page, hook, and utility in the frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the design system's color tokens in both light and dark modes, plus base body and border styles.",
  "frontend/index.html": "HTML entry point for the React app, including SEO meta tags, Google Fonts, Google Site Verification, and Google Ads gtag tracking script.",
  "frontend/public/googlea0b8f9f5757853f9.html": "Google site verification file used to confirm ownership of the domain with Google Search Console.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with three routes (home, /riyaz admin, /account) and wraps the app in a QueryClientProvider.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin table component that fetches and displays all bookings with sortable columns, a refresh button, and CSV export functionality, without any authentication checks.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin image editor that allows uploading service card images and updating the hero image URL, with upload progress tracking and preview thumbnails.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Admin UI component for viewing and updating per-square-foot pricing for POP/Gypsum, PVC, and Wall Molding services, with loading and save-confirmation states.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin UI component for enabling or disabling the four booking time slots (10AM, 1PM, 4PM, 7PM) using toggles, with save and loading state handling.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Empty file with no content.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Empty file with no content.",
  "frontend/src/components/booking/BookingSection.tsx": "Customer-facing booking form that collects name, mobile, location, property type, service, date, and time slot, then submits the booking and shows a success message or error.",
  "frontend/src/components/booking/bookingValidation.ts": "Validation utility for the booking form that checks all required fields and returns an object indicating validity and any field-level error messages.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Fixed floating button that links to the business WhatsApp chat, normalizing the phone number to include the India country code.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile-only sticky bottom bar with a 'Book Consultation' button that triggers a provided onClick callback.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Interactive estimate calculator that computes a cost based on entered area and selected service using live service rates, or shows an inspection-required message for inspection-based services.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer displaying company description, contact info, service list, copyright year, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky site header with the Ceiling Pro logo/link, an Account navigation button, and a call-to-action phone button.",
  "frontend/src/components/marketing/ContactSection.tsx": "Renders a contact section with phone, email, and service area info pulled from CEILING_PRO_CONFIG, displayed as three icon cards.",
  "frontend/src/components/marketing/GallerySection.tsx": "Displays a before/after image gallery using either custom image paths passed as props or default generated assets.",
  "frontend/src/components/marketing/HeroSection.tsx": "Full-width hero section with a background image, headline, and CTA buttons for booking a consultation or calling directly.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Shows a 3-step process (Book, Site Visit, Installation) with icons and descriptions in a horizontal grid layout.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Displays three hardcoded 5-star customer reviews in card components with name, location, and review text.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper component that supports white/grey variants and a scroll-triggered reveal animation.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Renders service cards from the SERVICES domain list with optional custom image overrides, fallback error handling, and a Book Now button that preselects the service.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Displays three hardcoded reasons to choose Ceiling Pro (Affordable, Skilled Experts, On-Time Delivery) as icon cards.",
  "frontend/src/config/ceilingPro.ts": "Exports a config object containing the business phone, WhatsApp, and email contact details for Ceiling Pro.",
  "frontend/src/context/AdminAuthContext.tsx": "Empty file with no content.",
  "frontend/src/domain/services.ts": "Defines the Service interface, the SERVICES array with four ceiling service entries, and a getServiceRate helper that resolves pricing from service rates or defaults.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an authenticated identity if available and initializing admin access control via a URL secret parameter.",
  "frontend/src/hooks/useAdminActor.ts": "Thin wrapper around useActor intended for admin operations; notes that the backend no longer requires special tokens.",
  "frontend/src/hooks/useAdminAuth.ts": "Empty file with no content.",
  "frontend/src/hooks/useBookings.ts": "Provides React Query hooks for fetching all bookings, fetching the current user's bookings, and creating a new booking via the backend actor.",
  "frontend/src/hooks/useImagePaths.ts": "Provides React Query hooks for fetching stored image paths and mutating them via the backend actor, with a backward-compatible useImagePaths alias.",
  "frontend/src/hooks/useImageUpload.ts": "Provides two React Query mutation hooks for uploading images to the backend actor: one for a single file with optional progress tracking, and one for multiple files sequentially. Validates file type and size (max 5MB) before upload.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status. Also exports a `useInternetIdentity` hook for consuming the context.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that calls `actor.isCallerAdmin()` to check whether the current caller has admin privileges, caching the result for 5 minutes.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Custom hook that uses IntersectionObserver to set a visibility flag when an element scrolls into view, with immediate visibility for users who prefer reduced motion.",
  "frontend/src/hooks/useServiceRates.ts": "Provides React Query hooks to fetch (`useGetServiceRates`) and update (`useUpdateServiceRates`) service pricing rates from the backend actor, with default fallback values.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "Provides React Query hooks to fetch (`useGetTimeSlotAvailability`) and update (`useUpdateTimeSlotAvailability`) booking time slot availability from the backend actor, with default all-enabled fallback values.",
  "frontend/src/hooks/useUserProfile.ts": "Provides React Query hooks to fetch the current caller's user profile (`useGetCallerUserProfile`) and save/update it (`useSaveCallerUserProfile`), invalidating the cached profile on successful save.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for a light/dark color theme (natural green primary, beige accents), and applies base typography and smooth scrolling.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` for data fetching and `InternetIdentityProvider` for authentication wrapping the root `App` component.",
  "frontend/src/pages/AccountPage.tsx": "User account page that handles three states: unauthenticated (login prompt), new user (profile setup form), and authenticated (displays profile and booking history). Uses Internet Identity for auth and React Query hooks for data.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that composes four management sections: image editor, service rates editor, time slots editor, and bookings table.",
  "frontend/src/pages/HomePage.tsx": "Main marketing landing page that assembles all section components (hero, services, gallery, booking, etc.), fetches image paths from the backend, and handles smooth scrolling to the booking section.",
  "frontend/src/state/bookingPrefill.ts": "Zustand store that holds a preselected service string used to prefill the booking form when navigating from a service card or CTA.",
  "frontend/src/utils/notifications.ts": "Provides browser Web Notifications API utilities, including requesting permission and showing a booking confirmation notification, with graceful handling of unavailability or denial.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based color tokens, extended border radii, Inter font, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the overall project state (version 43) for the Ceiling Pro booking website, including architectural decisions, known issues, and a list of implemented features."
}