{
  "kind": "build_request",
  "title": "Restore site header and footer on all public pages",
  "projectName": "Ceiling Pro",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-68",
      "text": "Restore the site header (SiteHeader component) so it renders correctly on all public-facing pages (homepage, account page), including the sticky top navigation with logo, Account menu entry, and the click-to-call phone button using the configured phone number (9834587806).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "You remove the header and footer area",
          "Please ad header and footer"
        ]
      },
      "acceptanceCriteria": [
        "The SiteHeader component is visible at the top of the homepage (/) on both mobile and desktop screen sizes.",
        "The SiteHeader component is visible at the top of the account page (/account) on both mobile and desktop screen sizes.",
        "The header contains the Ceiling Pro logo/brand link, an Account button, and the click-to-call phone button.",
        "The Admin entry is NOT visible in the header for public users.",
        "The header is sticky (remains at top on scroll)."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Restore the site footer (SiteFooter component) so it renders correctly at the bottom of all public-facing pages (homepage, account page), displaying company info, phone number (9834587806), email (ceilingpro9@gmail.com), services list, and copyright.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "You remove the header and footer area",
          "Please ad header and footer"
        ]
      },
      "acceptanceCriteria": [
        "The SiteFooter component is visible at the bottom of the homepage (/) on both mobile and desktop screen sizes.",
        "The SiteFooter component is visible at the bottom of the account page (/account) on both mobile and desktop screen sizes.",
        "The footer displays the phone number 9834587806, email ceilingpro9@gmail.com, and a services list.",
        "No GST label or placeholder is displayed in the footer.",
        "The footer renders without layout breakage on mobile viewports."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed under frontend.immutablePaths.",
    "The Admin entry must remain hidden from the public header.",
    "Do not alter the /riyaz admin dashboard layout or access model."
  ],
  "nonGoals": [
    "Redesigning or restyling the header or footer beyond restoring them to their prior working state.",
    "Adding new navigation links or sections to the header/footer.",
    "Changing contact phone number or email values."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}