{
  "backend/main.mo": "Main backend actor implementing booking management, user profiles, service rates, time slot availability, and image path configuration with authorization mixins for access control and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting the Google Ads tracking tag replacement from AW-17968689708 to AW-17969512168 in frontend/index.html.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages, hooks, and UI elements describing their functionality and key features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using OKLCH color space.",
  "frontend/index.html": "Main HTML entry point with Google Ads tracking tag (AW-17969512168), SEO meta tags, and site verification for Ceiling Pro false ceiling services.",
  "frontend/public/googlea0b8f9f5757853f9.html": "Google site verification file for domain ownership confirmation.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, admin (/riyaz), and account pages, wrapped in QueryClientProvider with shared layout.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin table component displaying bookings sorted by creation date with CSV export functionality and enhanced error display for authorization failures.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin interface for uploading and managing images including hero image, service cards, and gallery images with file validation and progress tracking.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Admin component for editing per-square-foot pricing for three services (POP & Gypsum, PVC, Wall Molding) using form inputs and BigInt conversion.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin component for toggling availability of four booking time slots (10am, 1pm, 4pm, 7pm) using switches.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Empty file, likely a placeholder for admin authentication/authorization logic.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Empty file, likely a placeholder for admin login form component.",
  "frontend/src/components/booking/BookingSection.tsx": "Customer-facing booking form with fields for personal details, property type, service selection, date/time slot, and area; includes validation and success handling.",
  "frontend/src/components/booking/bookingValidation.ts": "Validation logic for booking form fields including name, mobile number (Indian format), location, property type, service, date, time slot, and area.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Fixed-position WhatsApp button that normalizes phone numbers and links to WhatsApp chat.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile-only sticky bottom CTA button for triggering booking consultation.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live cost calculator that computes estimates based on area and selected service, with special handling for inspection-based services.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer with company info, contact details, service list, and attribution to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, account navigation link, and call button displaying company phone number.",
  "frontend/src/components/marketing/ContactSection.tsx": "Marketing section displaying contact information (phone, email, service areas) in a three-column grid layout.",
  "frontend/src/components/marketing/GallerySection.tsx": "Displays a before/after gallery section with default or custom images arranged in a 2-column grid. Accepts optional galleryImages prop to override default before/after images.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero section component with background image, headline, pricing tagline, and CTA buttons for booking consultation and calling. Accepts optional custom hero image path.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Displays a 3-step process section (Book, Site Visit, Installation) with icons and descriptions in a responsive grid layout.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Shows customer reviews in a 3-column card grid with star ratings, review text, and customer name/location.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper component with optional scroll-reveal animation, variant styling (white/grey), and container layout.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Displays service cards in a 4-column grid with images, pricing, descriptions, and Book Now buttons. Supports custom service images with fallback handling and prefills booking form on click.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Shows three reasons to choose the service (Affordable, Skilled Experts, On-Time Delivery) in a centered 3-column grid with check icons.",
  "frontend/src/config/ceilingPro.ts": "Configuration object containing contact information (phone, WhatsApp, email) for Ceiling Pro business.",
  "frontend/src/context/AdminAuthContext.tsx": "Empty file, likely placeholder for admin authentication context provider.",
  "frontend/src/domain/services.ts": "Defines service catalog with 4 ceiling services (POP/Gypsum, PVC, Wall Molding, Gypsum Repair) including pricing, descriptions, and image paths. Includes helper function to get service rates.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instance with Internet Identity authentication. Initializes access control with admin token and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useAdminActor.ts": "React Query hook that creates anonymous backend actor for admin dashboard (/riyaz) with hardcoded 'caffeine' admin token for access control initialization.",
  "frontend/src/hooks/useAdminAuth.ts": "Empty file, likely placeholder for admin authentication hook.",
  "frontend/src/hooks/useBookings.ts": "Provides React Query hooks for fetching all bookings (admin), user's bookings, and creating new bookings via backend actor with cache invalidation.",
  "frontend/src/hooks/useImagePaths.ts": "Provides React Query hooks to fetch and update image paths for hero, service cards, and gallery images, converting backend StoredImage objects to direct URLs for rendering.",
  "frontend/src/hooks/useImageUpload.ts": "Provides React Query mutation hooks for uploading single or multiple images with validation (type, size), progress tracking, and automatic path generation using ExternalBlob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with AuthClient integration, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current caller has admin privileges by querying the backend actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Custom hook using IntersectionObserver to trigger visibility state when an element scrolls into view, respecting prefers-reduced-motion.",
  "frontend/src/hooks/useServiceRates.ts": "React Query hooks to fetch and update service rates (popGypsum, pvc, wallMolding) with default fallback values.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "React Query hooks to fetch and update availability status for four daily time slots (10am, 1pm, 4pm, 7pm).",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks to fetch and save the current caller's user profile with proper loading state management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, typography, and responsive spacing utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AccountPage.tsx": "Account management page displaying login prompt for unauthenticated users, profile setup for new users, and profile/bookings view for authenticated users with logout functionality.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that renders sections for managing website images, service rates, time slot availability, and viewing all bookings.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that renders all marketing sections (hero, services, calculator, booking, gallery, reviews, contact) with scroll-to-booking functionality and image path integration.",
  "frontend/src/state/bookingPrefill.ts": "Zustand store for managing preselected service state in the booking flow, allowing services to be pre-filled from other sections.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with animations, typography, and container query plugins.",
  "project_state.json": "Project state document defining the Ceiling Pro booking website requirements, architectural decisions (no-password admin at /riyaz, fixed time slots, mobile-first), and known issues with bookings, admin access, and Google Search Console verification."
}