{
  "backend/main.mo": "Defines booking, service rate, and time-slot types with CRUD functions for bookings, service rates, availability, and estimate calculation.",
  "feature_evidence.json": "Lists implemented product features with associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides one-line summaries for key frontend source files including pages, components, hooks, and state modules.",
  "frontend/index.css": "Defines Tailwind CSS base layers and custom CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router with home and admin routes wrapped in a shared layout.",
  "frontend/src/components/admin/BookingsTable.tsx": "Displays bookings sorted by creation date with a CSV export option.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Admin form for viewing and updating POP, PVC, and wall molding service rates.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin UI to view and toggle time slot availability and save updates via API hooks.",
  "frontend/src/components/booking/BookingSection.tsx": "Booking form handling user input, validation, time‑slot filtering, and submission via createBooking.",
  "frontend/src/components/booking/bookingValidation.ts": "Validates booking form fields including name, mobile, date, time slot, and area.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Floating WhatsApp contact button linking to configured number.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile‑only sticky CTA bar triggering the booking action.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live estimate calculator computing cost based on service type, area, and dynamic rates.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying company info, contact details, services, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with brand, call button, and admin navigation link.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact information section showing phone, email, and service area details.",
  "frontend/src/components/marketing/GallerySection.tsx": "Before‑and‑after gallery displaying generated project images.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner with background image, headline, and buttons for booking or calling.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Renders a 3-step “How It Works” marketing section using icons and animated Section wrapper.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Displays customer reviews in card format with star ratings inside a Section component.",
  "frontend/src/components/marketing/Section.tsx": "Reusable layout section with background variants and scroll-reveal animation logic.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Shows a grid of service cards with pricing and a Book Now action that preselects a service.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Lists key reasons to choose the service provider with icons and descriptions.",
  "frontend/src/config/ceilingPro.ts": "Defines static contact and GST config for Ceiling Pro.",
  "frontend/src/domain/services.ts": "Defines service metadata and provides a helper to resolve service rates with defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useBookings.ts": "Fetches all bookings and provides a mutation to create new bookings via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and provides identity context.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Implements an IntersectionObserver hook to reveal elements when scrolled into view.",
  "frontend/src/hooks/useServiceRates.ts": "Fetches and updates service rate data via the backend actor with react-query.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "Retrieves and updates booking time-slot availability from the backend.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light/dark modes with layout tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin dashboard with editors for service rates, time slot availability, and a table of all bookings.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage UI and auto-scrolls to the booking section when a service is preselected.",
  "frontend/src/state/bookingPrefill.ts": "Defines a Zustand store for tracking and resetting a preselected booking service.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings for the project.",
  "project_state.json": "Stores project metadata, requirements, image needs, and architectural notes for the Ceiling Pro website."
}