{
  "backend/main.mo": "Main Motoko canister implementing admin authentication, access control, user profiles, bookings, service rates, time slots, and image path configuration.",
  "backend/migration.mo": "Migration module updating stored admin credentials while preserving other actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, theme variables, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React application.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and global layout with header, footer, and toast provider.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin bookings table with sorting and CSV export functionality.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin interface for editing hero, service card, and gallery image path settings.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "UI form that loads current service rates, allows editing three numeric rate fields, and submits updates via mutation.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin interface to toggle availability of predefined time slots and save the updated availability.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Wrapper that validates admin session, showing a loader or login form before rendering protected content.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Login form for admin users with validation, error display, and authentication submission.",
  "frontend/src/components/booking/BookingSection.tsx": "Customer booking form handling validation, prefills, time‑slot availability, submission, and success messaging.",
  "frontend/src/components/booking/bookingValidation.ts": "Validation utility that checks booking form fields for required values, formats, and logical date constraints.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Floating WhatsApp contact button that normalizes a phone number and links to a WhatsApp chat URL.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile-only sticky call‑to‑action bar that triggers a booking action when tapped.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live cost estimator that calculates or displays inspection messaging based on area, selected service, and service rates.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying company info, contact details, services list, and a powered-by attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the sticky site header with logo, account navigation, and call button using config phone number.",
  "frontend/src/components/marketing/ContactSection.tsx": "Displays contact info including phone, email, and service areas with icons.",
  "frontend/src/components/marketing/GallerySection.tsx": "Shows a before/after gallery using provided or default images.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner with background image, headline, and buttons for booking or calling.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Presents a three-step explanation of the service process with icons.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Shows customer reviews with star ratings in card layout.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper supporting variants and reveal-on-scroll animation.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Renders service cards with images, details, and booking buttons using service data.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Lists key reasons to choose the service with icons and descriptions.",
  "frontend/src/config/ceilingPro.ts": "Exports phone, WhatsApp, and email configuration values.",
  "frontend/src/domain/services.ts": "Defines service data and helper to compute service rates from backend values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminAuth.ts": "Manages admin authentication state, login, logout, and session validation using the actor.",
  "frontend/src/hooks/useBookings.ts": "Provides hooks to fetch all bookings, fetch user-specific bookings, and create bookings with cache invalidation.",
  "frontend/src/hooks/useImagePaths.ts": "Fetches and updates website image paths with defaults and admin-authorization handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and stored identity restoration.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Queries whether the current caller is an admin with minimal retry and caching.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Implements an intersection observer hook to reveal elements when scrolled into view.",
  "frontend/src/hooks/useServiceRates.ts": "Fetches and updates service rates, providing defaults when unauthenticated.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "Fetches and updates availability of time slots with fallback defaults.",
  "frontend/src/hooks/useUserProfile.ts": "Loads and saves the authenticated user's profile with proper query state handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark themes, global styles, and mobile adjustments.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Account page handling login, profile setup, profile management, and viewing user bookings.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing images, rates, time slots, and bookings behind admin auth.",
  "frontend/src/pages/HomePage.tsx": "Home page component assembling marketing sections, image-driven content, and smooth-scroll booking behavior. It scrolls to the booking section when a preselected service exists.",
  "frontend/src/state/bookingPrefill.ts": "Zustand store that manages a preselected booking service and provides setters and a clear function.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugins enabled.",
  "project_state.json": "Project metadata describing requirements, architecture notes, admin rules, and existing features for the Ceiling Pro booking site."
}