{
  "backend/main.mo": "Main canister defining bookings, user profiles, admin auth, image paths, service rates, and time slot management with access control.",
  "backend/migration.mo": "Migration module that removes the old adminCredentials field from persisted actor state.",
  "feature_evidence.json": "Feature evidence report mapping admin auth-flow changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and behavior.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and base element styling.",
  "frontend/index.html": "Base HTML document loading the React app and including metadata, fonts, and root container.",
  "frontend/src/App.tsx": "React app entry configuring routing, layout, and global admin auth provider.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin table displaying sorted bookings with CSV export capability.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin UI for editing hero, service card, and gallery image paths with save functionality.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Form to view and update per-square-foot service rates, loading initial values and submitting updates via hooks.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin UI to toggle availability of booking time slots and save updated slot states.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Wrapper that validates admin session, shows a loader or login form, and renders protected content when authenticated.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Admin login form handling username/password submission, validation, and error display.",
  "frontend/src/components/booking/BookingSection.tsx": "Booking form for user consultations with validation, prefill support, time slot filtering, and booking submission.",
  "frontend/src/components/booking/bookingValidation.ts": "Validates booking form fields, returning error messages and a boolean validity flag.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Floating WhatsApp contact button that normalizes the phone number and opens a chat link.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile-only sticky CTA bar with a button that triggers the booking flow.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live estimate calculator that computes costs or shows inspection-required notices based on area, service, and rates.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer displaying company info, contacts, services, and a powered-by link with the current year.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with branding, account navigation, and click-to-call button using config phone number.",
  "frontend/src/components/marketing/ContactSection.tsx": "Displays phone, email, and service area contact info using config values.",
  "frontend/src/components/marketing/GallerySection.tsx": "Renders before/after gallery with optional custom images or defaults.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner with background image, headline, and consultation or call-to-action buttons.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Three-step process section showing booking, site visit, and installation steps.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Shows customer reviews with star ratings and testimonial text.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper with styling variants and scroll-reveal animation.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Lists service cards with images, descriptions, pricing, and booking actions.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Highlights key selling points like pricing, expertise, and timely delivery.",
  "frontend/src/config/ceilingPro.ts": "Provides contact configuration including phone, WhatsApp, and email.",
  "frontend/src/context/AdminAuthContext.tsx": "Admin auth context handling login, logout, session validation, and state management.",
  "frontend/src/domain/services.ts": "Defines service metadata and helper to resolve service rates with defaults or backend values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Handles admin login, session validation, logout, and error state using the backend actor.",
  "frontend/src/hooks/useBookings.ts": "Provides queries and mutations for fetching, creating, and managing bookings through the backend actor.",
  "frontend/src/hooks/useImagePaths.ts": "Fetches and updates image path configuration, applying defaults and handling unauthorized errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state and login/clear actions.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Checks whether the current caller is an admin using the backend actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Provides a ref and visibility state triggered by intersection observer scroll reveal.",
  "frontend/src/hooks/useServiceRates.ts": "Gets and updates service rate values from the backend, with defaults when unauthenticated.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "Fetches and updates availability of predefined time slots via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Retrieves and updates the caller’s user profile using backend actor queries and mutations.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode styles, and global typography and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers, rendering the root App component.",
  "frontend/src/pages/AccountPage.tsx": "Handles customer authentication via Internet Identity, profile setup, logout, and displays the user's bookings when logged in.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard wrapper showing editors for images, service rates, time slots, and bookings, protected by admin auth with a logout button.",
  "frontend/src/pages/HomePage.tsx": "Home landing page assembling all marketing sections, image‑driven components, and a scroll‑to booking flow using preselected services.",
  "frontend/src/state/bookingPrefill.ts": "Zustand store that tracks a preselected service and provides setters for booking prefill state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, persisting them in sessionStorage, and manipulating hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, plugins, and content paths.",
  "project_state.json": "Project metadata describing required features, architectural notes, known issues, and current state for the Ceiling Pro website."
}