{
  "backend/main.mo": "Main Motoko actor implementing booking management, service rates, time slot availability, image path configuration, user profiles, and admin authorization with access control mixins for blob storage and authentication.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of Google Ads tracking tag (gtag.js) with conversion ID AW-17968689708 in frontend/index.html.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including pages, layouts, marketing sections, booking forms, admin interfaces, and custom hooks for the ceiling services application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point with Google Ads gtag.js tracking (AW-17968689708), Google site verification meta tag, SEO metadata for ceiling services, and Inter font preloading.",
  "frontend/public/googlea0b8f9f5757853f9.html": "Google site verification file for domain ownership confirmation.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home (/), admin (/riyaz), and account (/account), wrapped in QueryClientProvider with shared layout including header, footer, and toaster.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin bookings table component displaying sorted bookings by creation date with CSV export functionality and enhanced error handling showing backend error messages.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin interface for uploading and managing images including hero image, four service cards, and gallery images with file validation (type and 5MB size limit) and upload progress tracking.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Admin component for editing per-square-foot pricing for three services (POP/Gypsum, PVC, Wall Molding) with form inputs and save functionality using React hooks and mutations.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Admin component for toggling availability of four booking time slots (10am, 1pm, 4pm, 7pm) with switches and save functionality.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Empty file, likely intended for admin authentication/authorization gating logic.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Empty file, likely intended for admin login form UI.",
  "frontend/src/components/booking/BookingSection.tsx": "Customer-facing booking form with fields for personal info, property details, service selection, date/time slot picker, and area input; includes validation, success messaging, and preselected service support.",
  "frontend/src/components/booking/bookingValidation.ts": "Validation logic for booking form fields including name, mobile number (10-digit Indian format), location, property type, service, date (future only), time slot, and area (positive number).",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Fixed-position WhatsApp chat button that normalizes phone numbers and links to WhatsApp with the configured business number.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile-only sticky bottom bar with a 'Book Consultation' button that triggers a callback when clicked.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live cost calculator that computes estimates based on area and selected service using service rates, with special handling for inspection-based services.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer displaying company info, contact details, service list, copyright notice, and attribution link to caffeine.ai.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo/brand link, account navigation button, and call-to-action phone button.",
  "frontend/src/components/marketing/ContactSection.tsx": "Marketing section displaying contact information (phone, email, service areas) in a three-column grid with icons.",
  "frontend/src/components/marketing/GallerySection.tsx": "Displays a before/after gallery section with default or custom images in a 2-column grid layout. Accepts optional galleryImages prop to override default before/after images.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero section component with background image, headline, pricing info, and CTA buttons for booking consultation and calling. Accepts optional custom hero image path.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Displays a 3-step process section (Book, Site Visit, Installation) in a grid layout with icons and descriptions for each step.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Shows customer reviews in a 3-column card grid with star ratings, review text, and customer name/location.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper component with optional scroll-reveal animation, variant styling (white/grey background), and container layout.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Displays service cards in a 4-column grid with images, pricing, descriptions, and Book Now buttons. Supports custom service images with fallback to defaults and handles image loading errors.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Shows three reasons to choose the service (Affordable, Skilled Experts, On-Time Delivery) in a centered 3-column grid with icons.",
  "frontend/src/config/ceilingPro.ts": "Configuration object containing contact information (phone, WhatsApp, email) for Ceiling Pro business.",
  "frontend/src/context/AdminAuthContext.tsx": "Empty file, likely placeholder for admin authentication context.",
  "frontend/src/domain/services.ts": "Defines service data model and array of four ceiling services (POP/Gypsum, PVC, Wall Molding, Gypsum Repair) with pricing, descriptions, and image paths. Includes helper function to get service rates.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instance with Internet Identity authentication, initializing access control with admin token from URL params.",
  "frontend/src/hooks/useAdminActor.ts": "React Query hook that creates anonymous backend actor for admin dashboard (/riyaz) with hardcoded 'caffeine' admin token for access control initialization.",
  "frontend/src/hooks/useAdminAuth.ts": "Empty file, likely placeholder for admin authentication hook.",
  "frontend/src/hooks/useBookings.ts": "React Query hooks for fetching all bookings (admin), user's bookings, and creating new bookings via backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useImagePaths.ts": "Provides React Query hooks to fetch and update image paths for hero, service cards, and gallery images, converting backend StoredImage objects to direct URLs for rendering.",
  "frontend/src/hooks/useImageUpload.ts": "Provides React Query mutation hooks for uploading single or multiple images with validation (type, size), progress tracking, and automatic path generation using ExternalBlob.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with AuthClient integration, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "React Query hook that checks if the current caller has admin privileges by querying the backend actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Custom hook using IntersectionObserver to detect when an element becomes visible during scroll, respecting prefers-reduced-motion preference.",
  "frontend/src/hooks/useServiceRates.ts": "React Query hooks to fetch and update service rates (popGypsum, pvc, wallMolding) with default fallback values.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "React Query hooks to fetch and update availability status for four daily time slots (10am, 1pm, 4pm, 7pm).",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks to fetch and save the current caller's user profile with proper actor dependency handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using natural green and beige color palette, plus base styling for typography and responsive spacing.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AccountPage.tsx": "Account page component handling authentication flow, profile setup for new users, and displaying user bookings with logout functionality.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that renders four editor components: ImagesEditor, ServiceRatesEditor, TimeSlotsEditor, and BookingsTable for managing website content and bookings.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that renders all marketing sections (hero, services, gallery, etc.), handles scroll-to-booking functionality, and passes image paths from API to child components.",
  "frontend/src/state/bookingPrefill.ts": "Zustand store for managing preselected service state used to prefill the booking form and trigger auto-scroll to booking section.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components (sidebar, chart, card, etc.), custom animations, and typography/container-query plugins.",
  "project_state.json": "Project state document defining the Ceiling Pro booking website requirements, architectural decisions (no email, fixed time slots, /riyaz admin route), and known issues including missing bookings in admin dashboard and service image problems."
}