{
  "backend/main.mo": "Main actor implementing bookings, user profiles, service rates, time slots, and image path management with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by resetting image path structures to the new blob-based schema.",
  "feature_evidence.json": "Feature evidence report mapping two frontend image-handling features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file for reference in build planning.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, theming variables, and base styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root React app with metadata, fonts, and the main script.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router routes, layout, and QueryClientProvider.",
  "frontend/src/components/admin/BookingsTable.tsx": "Admin table displaying sorted bookings with CSV export functionality.",
  "frontend/src/components/admin/ImagesEditor.tsx": "Admin tool for uploading and saving hero, service card, and gallery images with API hooks and toast feedback.",
  "frontend/src/components/admin/ServiceRatesEditor.tsx": "Form for editing and saving service rates using API hooks with basic validation and loading states.",
  "frontend/src/components/admin/TimeSlotsEditor.tsx": "Interface to toggle booking time‑slot availability and save updates through API hooks.",
  "frontend/src/components/auth/AdminAccessGate.tsx": "Empty file.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Empty file.",
  "frontend/src/components/booking/BookingSection.tsx": "Booking form handling validation, time‑slot availability, submission, and optional prefilled service.",
  "frontend/src/components/booking/bookingValidation.ts": "Validates booking form fields including name, phone, date, service, and area with specific rules.",
  "frontend/src/components/conversion/FloatingWhatsAppButton.tsx": "Floating WhatsApp CTA button linking to a normalized phone number.",
  "frontend/src/components/conversion/StickyBookCta.tsx": "Mobile sticky CTA bar with a button to trigger booking.",
  "frontend/src/components/estimate/EstimateCalculatorSection.tsx": "Live cost estimator computing service pricing based on area and selected service, with inspection handling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing brand info, contact details, service list, and a powered‑by link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with navigation to account and a call button using config phone number.",
  "frontend/src/components/marketing/ContactSection.tsx": "Displays contact details including phone, email, and service areas in a styled section.",
  "frontend/src/components/marketing/GallerySection.tsx": "Shows a before/after image gallery using provided images or fallback defaults.",
  "frontend/src/components/marketing/HeroSection.tsx": "Renders the hero banner with background image, headline, and buttons for booking or calling.",
  "frontend/src/components/marketing/HowItWorksSection.tsx": "Presents a three-step process with icons explaining how the service works.",
  "frontend/src/components/marketing/ReviewsSection.tsx": "Displays customer reviews with star ratings inside card components.",
  "frontend/src/components/marketing/Section.tsx": "Reusable section wrapper with optional reveal-on-scroll animation and style variants.",
  "frontend/src/components/marketing/ServicesSection.tsx": "Renders service cards with images, details, and booking actions, supporting custom image overrides.",
  "frontend/src/components/marketing/WhyChooseSection.tsx": "Lists key reasons to choose the service with icons and brief descriptions.",
  "frontend/src/config/ceilingPro.ts": "Exports static contact configuration including phone, WhatsApp, and email.",
  "frontend/src/context/AdminAuthContext.tsx": "Empty file with no implementation.",
  "frontend/src/domain/services.ts": "Defines service metadata, default rates, and a helper to get pricing based on rate keys.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with identity handling and automatic query invalidation.",
  "frontend/src/hooks/useAdminAuth.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useBookings.ts": "Provides hooks to fetch all bookings, user bookings, and create a new booking via the actor.",
  "frontend/src/hooks/useImagePaths.ts": "Provides hooks to fetch and update image paths from the backend, converting stored images to direct URLs and supplying defaults when no actor is available.",
  "frontend/src/hooks/useImageUpload.ts": "Implements single and multiple image upload mutations that convert files to ExternalBlobs and upload them to backend storage with progress tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider for handling authentication state, login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Queries the backend to determine if the current caller is an admin, with errors defaulting to false.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Exposes a hook using IntersectionObserver to reveal elements when they enter the viewport, respecting reduced‑motion settings.",
  "frontend/src/hooks/useServiceRates.ts": "Fetches and updates service rate data from the backend, returning defaults when no actor is available.",
  "frontend/src/hooks/useTimeSlotAvailability.ts": "Retrieves and updates booking time slot availability from the backend, with fallback defaults when no actor exists.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and save the caller’s user profile, handling actor‑dependent loading states.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus global layout and typography styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/AccountPage.tsx": "Renders the account page with login flow, profile setup, profile saving, and a user’s bookings display.",
  "frontend/src/pages/AdminPage.tsx": "Displays the admin dashboard with editors for images, service rates, time slots, and a bookings table.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with multiple marketing sections and scrolls to the booking section when a service is preselected.",
  "frontend/src/state/bookingPrefill.ts": "Defines a Zustand store for storing and clearing a preselected booking service.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, plugins, colors, animations, and responsive container settings.",
  "project_state.json": "Describes the project's current state, requirements, architecture notes, and implemented features for the Ceiling Pro website."
}