{
  "kind": "build_request",
  "title": "Update admin credentials, restore prior service images, and change public contact email",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Update the backend’s admin login credentials to username \"Sirajahmad\" and password \"S1i2r3\" so that logging into /admin only succeeds with these new values (replacing the current defaults). Ensure the change applies to upgraded canisters as well (i.e., existing persisted credential state should be updated to the new username/password during upgrade).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Make username.  Sirajahmad \nPassword.  S1i2r3"
        ]
      },
      "acceptanceCriteria": [
        "Attempting admin login with username \"Sirajahmad\" and password \"S1i2r3\" returns success (true)",
        "Attempting admin login with the previous default credentials (\"admin\" / \"1234\") returns failure (false)",
        "After deploying an upgrade (not a fresh install), the admin login still uses the new credentials (not the old persisted defaults)"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Change the public contact email displayed across the website to \"ceilingpro9@gmail.com\" by updating the shared contact configuration and ensuring all UI that renders email (at minimum: Contact section and Footer) reflects the new value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Change email . ceilingpro9@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "The Contact section email link uses mailto:ceilingpro9@gmail.com and displays \"ceilingpro9@gmail.com\"",
        "The Footer displays \"ceilingpro9@gmail.com\"",
        "No customer-facing UI still shows the old email value"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Restore/insert the previous images for the 4 service cards in the \"Our Services\" section by switching the service card image paths back to the prior set used by the project (e.g., the /images/service*.jpg style paths) so that the Services section shows those previous images again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Or inser previous images in our service section"
        ]
      },
      "acceptanceCriteria": [
        "The \"Our Services\" section service-card images render using the restored previous image paths (not the newer generated defaults)",
        "All 4 service cards show non-broken images on a hard refresh",
        "The service card images remain individually controllable via the existing image-paths mechanism (admin image paths), with the restored images acting as defaults where appropriate"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add/adjust migration code if required for an upgrade.",
    "Do not edit any files under frontend/src/components/ui or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change phone/WhatsApp numbers (they must remain 9834587806 as already specified).",
    "Do not add new authentication providers or third-party login systems.",
    "Do not add email-sending functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}