{
  "kind": "build_request",
  "title": "Fix admin login so correct username/password grants access to /admin",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Fix backend admin authentication so that a successful `adminLogin(username, password)` reliably grants admin access for the same caller on subsequent calls (including page refresh), and so that `isAdminUser()` returns `true` immediately after a successful login for that caller.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "They can't give me access admin panel even if put right username and password fix it"
        ]
      },
      "acceptanceCriteria": [
        "Calling `adminLogin(\"Sirajahmad\",\"S1i2r3\")` returns `true`.",
        "After a successful `adminLogin`, calling `isAdminUser()` from the same browser/session returns `true` (no incognito window required).",
        "Calling `adminLogin` with an incorrect username or password returns `false` and does not grant admin access (subsequent `isAdminUser()` remains `false`)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update backend authorization checks for all admin-only endpoints (at minimum: `getAllBookings`, `updateServiceRates`, `updateTimeSlotAvailability`, `updateImagePaths`) to use the same admin-auth mechanism as `isAdminUser()` so that the admin dashboard can load and perform all admin actions after login.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "They can't give me access admin panel even if put right username and password fix it"
        ]
      },
      "acceptanceCriteria": [
        "After successful admin login, the admin dashboard can load: bookings table, service rates editor, time slot editor, and images editor without unauthorized traps.",
        "If not logged in as admin, each admin-only endpoint traps/denies access and the frontend remains behind the login screen."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Adjust the frontend admin auth flow to verify backend session state after login and to handle session validation consistently (so the UI does not show a logged-in admin state unless `isAdminUser()` confirms it).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "They can't give me access admin panel even if put right username and password fix it"
        ]
      },
      "acceptanceCriteria": [
        "After clicking “Login” with correct credentials, the admin dashboard content renders (not stuck on login form).",
        "After a page refresh, if the browser has the stored admin session marker, the app re-validates via `isAdminUser()` and shows the dashboard when the backend confirms admin status.",
        "If credentials are wrong, the login form shows an error and the dashboard content does not render."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files in frontend immutablePaths (notably frontend/src/hooks/useActor.ts).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding Internet Identity as a requirement for admin access.",
    "Adding third-party authentication providers.",
    "Implementing email notifications or any email sending."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}