{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix frontend admin auth flow and session validation for /admin",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Make /admin UI reflect backend-confirmed admin status by sharing auth state, validating session after login, and re-validating on refresh.",
      "acceptanceCriteria": [
        "After clicking “Login” with correct credentials, the admin dashboard content renders (not stuck on login form).",
        "After a page refresh, if the browser has the stored admin session marker, the app re-validates via `isAdminUser()` and shows the dashboard when the backend confirms admin status.",
        "If credentials are wrong, the login form shows an error and the dashboard content does not render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/context/AdminAuthContext.tsx",
          "operation": "create",
          "description": "Create an AdminAuthProvider + useAdminAuthContext hook to ensure AdminAccessGate, AdminLoginForm, and AdminPage share a single admin-auth state instance (avoids per-component hook state divergence)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the routed application layout with AdminAuthProvider so /admin gating and login use a single shared admin-auth state across the route tree."
        },
        {
          "path": "frontend/src/hooks/useAdminAuth.ts",
          "operation": "modify",
          "description": "Adjust admin login/session logic to only mark the UI as logged-in after backend-confirmed admin status (call `isAdminUser()` after a successful `adminLogin`), keep localStorage as a marker only, and invalidate/refresh relevant cached queries after login/logout so the dashboard reliably renders the protected content."
        },
        {
          "path": "frontend/src/components/auth/AdminAccessGate.tsx",
          "operation": "modify",
          "description": "Switch from calling useAdminAuth directly to using the shared AdminAuthContext; ensure session validation runs when the gate mounts and that the gate never renders protected children unless the shared state isAdmin is confirmed by `isAdminUser()`."
        },
        {
          "path": "frontend/src/components/auth/AdminLoginForm.tsx",
          "operation": "modify",
          "description": "Use the shared AdminAuthContext for login/loading/error; on submit, rely on the updated login flow that verifies backend admin state, and keep showing an English error message when backend confirmation fails."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Use the shared AdminAuthContext for logout so logout consistently clears the shared admin state and prevents the dashboard from rendering after logout or failed session validation."
        }
      ]
    }
  ]
}