{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update public contact email and restore prior default service-card images",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Update shared contact config so all UI displays the new public email ceilingpro9@gmail.com (at minimum Contact section and Footer).",
      "acceptanceCriteria": [
        "The Contact section email link uses mailto:ceilingpro9@gmail.com and displays \"ceilingpro9@gmail.com\"",
        "The Footer displays \"ceilingpro9@gmail.com\"",
        "No customer-facing UI still shows the old email value"
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/ceilingPro.ts",
          "operation": "modify",
          "description": "Update CEILING_PRO_CONFIG.email to \"ceilingpro9@gmail.com\" so all components using shared contact config render the new email."
        },
        {
          "path": "frontend/src/components/marketing/ContactSection.tsx",
          "operation": "modify",
          "description": "Confirm the Contact section renders the email exclusively from CEILING_PRO_CONFIG.email (no hardcoded fallback), ensuring the mailto: link and visible text reflect the new value."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Confirm the footer renders the email exclusively from CEILING_PRO_CONFIG.email (no hardcoded fallback), ensuring it reflects the new value everywhere it appears."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Restore prior default images for the 4 \"Our Services\" service cards using the previous /images/service*.jpg-style paths while keeping admin-configured image paths as overrides.",
      "acceptanceCriteria": [
        "The \"Our Services\" section service-card images render using the restored previous image paths (not the newer generated defaults)",
        "All 4 service cards show non-broken images on a hard refresh",
        "The service card images remain individually controllable via the existing image-paths mechanism (admin image paths), with the restored images acting as defaults where appropriate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useImagePaths.ts",
          "operation": "modify",
          "description": "Switch the default/fallback serviceCard1-4 image paths from the newer generated assets to the prior /images/service*.jpg-style defaults, while preserving the existing override behavior when backend-provided image paths are non-empty."
        },
        {
          "path": "frontend/src/domain/services.ts",
          "operation": "modify",
          "description": "Update the SERVICES[].imagePath defaults for the four services to match the restored prior /images/service*.jpg-style paths so ServicesSection defaults align with the restored images when no overrides are provided."
        },
        {
          "path": "frontend/src/components/admin/ImagesEditor.tsx",
          "operation": "modify",
          "description": "Update helper/placeholder text for the service-card image path inputs to reflect the restored prior /images/service*.jpg-style default paths (without changing the admin override mechanism)."
        },
        {
          "path": "frontend/public/images/service1.jpg",
          "operation": "create",
          "description": "Add/restore the prior default Service Card 1 image file so /images/service1.jpg loads reliably on hard refresh (ensure filename matches the chosen default path)."
        },
        {
          "path": "frontend/public/images/service2.jpg",
          "operation": "create",
          "description": "Add/restore the prior default Service Card 2 image file so /images/service2.jpg loads reliably on hard refresh (ensure filename matches the chosen default path)."
        },
        {
          "path": "frontend/public/images/service3.jpg",
          "operation": "create",
          "description": "Add/restore the prior default Service Card 3 image file so /images/service3.jpg loads reliably on hard refresh (ensure filename matches the chosen default path)."
        },
        {
          "path": "frontend/public/images/service4.jpg",
          "operation": "create",
          "description": "Add/restore the prior default Service Card 4 image file so /images/service4.jpg loads reliably on hard refresh (ensure filename matches the chosen default path)."
        }
      ]
    }
  ]
}